node {
  name: "global_step/Initializer/zeros/shape_as_tensor"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
          }
        }
      }
    }
  }
}
node {
  name: "global_step/Initializer/zeros/Const"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 0
      }
    }
  }
}
node {
  name: "global_step/Initializer/zeros"
  op: "Fill"
  input: "global_step/Initializer/zeros/shape_as_tensor"
  input: "global_step/Initializer/zeros/Const"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "index_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "global_step"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "shape"
    value {
      shape {
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "global_step/Assign"
  op: "Assign"
  input: "global_step"
  input: "global_step/Initializer/zeros"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "global_step/read"
  op: "Identity"
  input: "global_step"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/IsVariableInitialized"
  op: "IsVariableInitialized"
  input: "global_step"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
}
node {
  name: "global_step/cond/Switch"
  op: "Switch"
  input: "global_step/IsVariableInitialized"
  input: "global_step/IsVariableInitialized"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/switch_t"
  op: "Identity"
  input: "global_step/cond/Switch:1"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/switch_f"
  op: "Identity"
  input: "global_step/cond/Switch"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/pred_id"
  op: "Identity"
  input: "global_step/IsVariableInitialized"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/read"
  op: "Identity"
  input: "global_step/cond/read/Switch:1"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/read/Switch"
  op: "RefSwitch"
  input: "global_step"
  input: "global_step/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/Switch_1"
  op: "Switch"
  input: "global_step/Initializer/zeros"
  input: "global_step/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/Merge"
  op: "Merge"
  input: "global_step/cond/Switch_1"
  input: "global_step/cond/read"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/add/y"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 0
      }
    }
  }
}
node {
  name: "global_step/add"
  op: "Add"
  input: "global_step/cond/Merge"
  input: "global_step/add/y"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "tensors/component_0"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 13
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_DOUBLE
        tensor_shape {
          dim {
            size: 13
          }
        }
        tensor_content: "\215\2429\212\325fk\300\010\245y!\260w;\300O\266\270?\t\333P\300\213k\225\332\232\224h\300\251#\330S\022\344C@\006\333`\304\211(^\300/\235\254\271\213\357\177\300\311\370\020+\200k}\300\3521\303\230\\\262s\300\267\265>@\314\317w\300\250.\347gY\317x\300\302\352\003k\302zs\300@\221\203\350c\310l\300"
      }
    }
  }
}
node {
  name: "tensors/component_1"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 13
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_DOUBLE
        tensor_shape {
          dim {
            size: 13
          }
        }
        tensor_content: "\333>\207\353\212\302d@\306\257\031\007[T[@/\021\023\374)\371l@m\032\205\222\374Cl@\007\026\315\317\203\206g@_\232x\000\007\361P@\023-$\346\353\313H@Jy\261\036\210\026Q@4Of\233\002\234=@\373d\211\316\245\222I@Q\267\341\332\360\001L@\3266\013\374\007\376L@n\237\'C.\333M@"
      }
    }
  }
}
node {
  name: "tensors/component_2"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 13
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_DOUBLE
        tensor_shape {
          dim {
            size: 13
          }
        }
        tensor_content: "\333_/W\252\360K\300<\373\334\303\177ED\300\252\264B\260\254:a\300C\201*Bu\301Y\300\037>\355\262Y[_\300.\025mq.\274V\300ih\340\265\316\253(@\277\207\226\032ybH\300W\372Q\336\037\376Q\300JW<M\377\334\013\300\032\001\031\t\021\317B\300\021\037\337\276#&T\300\354\244\334\210\251\030>\300"
      }
    }
  }
}
node {
  name: "tensors/component_3"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 13
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_DOUBLE
        tensor_shape {
          dim {
            size: 13
          }
        }
        tensor_content: "\0166\241\325\232\013D\300j$\310\r[rD@\020\027\362\177\300z@@\177{\240\030\006FJ@M\022:\370\331\034U@\37190_\370~\"@\373\342d\206y\2470@}\345V\335\367o\033\3003\332o\017\375\302\372\277\271\371,\n<\361\034\300N\274\244A2\271\370\277\036\245\321}\245\316<@\342\372\231\272\017\0028\300"
      }
    }
  }
}
node {
  name: "tensors/component_4"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 13
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_DOUBLE
        tensor_shape {
          dim {
            size: 13
          }
        }
        tensor_content: "\014+C^\2443 \300\354\224sx A\'@\367\252\275u\341\216.@\244w%\241(w4\300\336/\374D\034\003<\300~\034\340\326\324\212A\300P\2141\271@8(@\366\217[\251M\242\023\300\246\350\351\215\216\021E\300\016\24563\305\2435\300CC\271\234r\2235\300\r\306v\036\356\330I\300\307\032\216\374\365?:\300"
      }
    }
  }
}
node {
  name: "tensors/component_5"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 13
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_DOUBLE
        tensor_shape {
          dim {
            size: 13
          }
        }
        tensor_content: "\240\373v\236\227\253\004\300%c\365\000{\032\037\300\245\312\316\311\207\2274\300\366T\227\370v\272\025@\213\255\277\251\004X\035\300\256n\320I3\3652\300\215\374\021\302\305u\037@^\307\260\255\250\037A\300r\026T\343\341\3010\300\270\350\357\315\326\335&\300\323\364\341U\314/C\300\314\334q\357vF.\300G\021Eu\243\232C\300"
      }
    }
  }
}
node {
  name: "tensors/component_6"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 13
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_DOUBLE
        tensor_shape {
          dim {
            size: 13
          }
        }
        tensor_content: "\027Wa}\362\227\"@\360dlN\246\356+\300R\327j>T\345\035\300\314\374T~R\n:@\034\2451\216\222\2577@\201\035M\325\311\344\021@\205\312iQt\032!@)P\222s\333p\306\277\016\265\263\017$\247\362\277\371\366b\343\335\3042@\205n\352O\370\343\324\277.\307\210\212\031\340!\300\362u\001\n\376\251\001@"
      }
    }
  }
}
node {
  name: "tensors/component_7"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 13
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_DOUBLE
        tensor_shape {
          dim {
            size: 13
          }
        }
        tensor_content: "\213\202#\332\212\003\020@V\021\320+H\034\022@\033&\222\337$\2472\300\227\333C8Ri3\300\031\016\014\313\243\031;\300\177\323O\2178\226\021\300\003\224\272\226\356\327\032@7\255\330\376\233\3324@\241rt\365_\3102@d\343\016Q\001,&@j\347\360\211\324F\010\300\r\327\264\036^\2467@\325=\341\"\177\3161@"
      }
    }
  }
}
node {
  name: "tensors/component_8"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 13
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_DOUBLE
        tensor_shape {
          dim {
            size: 13
          }
        }
        tensor_content: "\001\275\275\360\'\n\366?\215\310\320)`\2158\300\250\357\350\327M\343\022@\013\274\270[\252;7@\304\360\352w\035p9@\271\246,\002\253\"\036\300i:\264\014\246*\030@K4f\222\034\315\035@\204\031s\376\225N\263?\3129\266<|\2426\300\037zb1\016#2@=\\\354\320zw\036\300K\247\323\344\37180\300"
      }
    }
  }
}
node {
  name: "tensors/component_9"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 13
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_DOUBLE
        tensor_shape {
          dim {
            size: 13
          }
        }
        tensor_content: "\331\200\274\323e[\027@\303\267\233\351\320\r2@\250\264\023\225\317|7\300fg\343\313\230\257(\300)\251g\312\3047\032\300\242\251\337z5\2204\300\277\336&#\321\002\003@yC\361r\026W!@E\234\360\210\371\202&\300\341\312\306\303X\300%\300p\300N\020\235\0224\300WG81\315N7\300+\301Re\030\374\313?"
      }
    }
  }
}
node {
  name: "tensors/component_10"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 13
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_DOUBLE
        tensor_shape {
          dim {
            size: 13
          }
        }
        tensor_content: "o\341\330\"+\246\035@\200\370<\250\213\2121\300X\300\244\272\351)1\300C\321\355\017\243g\376?cC\266Q\345+\007@\360/~\247H!\001\300d\006\263\240\220,\000@\315\275q\372\324\276\025\300\266v\243\2517\021\'\300dj|% ]\013\300\362aV\377\022f\016\3003\221[\313[\211\003\300\306_\230\316\343\342\014\300"
      }
    }
  }
}
node {
  name: "tensors/component_11"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 13
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_DOUBLE
        tensor_shape {
          dim {
            size: 13
          }
        }
        tensor_content: "\263\274\253\314\202\305\020@\320\237k\344t\220)@&o\"z\222\241\035\300\023#Y-#\326 @B\007\235\370\005]#@\034\021\237Aa\376)\300\247\377\206w\236>\000@\022\017Pw~F\377\277\027\373\340h\272\270\010\300\357\005\333?\357\335)\300\\X\256J-\245+\300\302R}\233\004\234\366?\246\276\240\023\372\244*\300"
      }
    }
  }
}
node {
  name: "tensors/component_12"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 13
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_DOUBLE
        tensor_shape {
          dim {
            size: 13
          }
        }
        tensor_content: "\272\211\000a\235\206\013\300ptwE\257\356,\300rl\245Q\305\372=\300\356:^\321\312\336.\300\257N?\023\354D.\300\220V}\346\254\333\022\300+\367\301\204b\243\332?\024\226\3425\234;%@\242\274Y\035j\373$\300\002B\327]\244\351\034\300%W\177v\256\"5\300H\037cx\355|1\300\036\253\001\344\007\005&\300"
      }
    }
  }
}
node {
  name: "tensors/component_13"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 13
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_DOUBLE
        tensor_shape {
          dim {
            size: 13
          }
        }
        tensor_content: "\307\3021\250\314V\373\2779\371\205y|\262\273?\277\020M%S\221\000\300\362]\353.\223\274\"@[Q\311\321 ?%@\325\'\377\344\022\032\365\277\213\267\302R\371\202\372?\336\261\310\346T\2222\300\373i\374\362]\326\037\300\371\203\023J\035 \375\277\275Fo\265M\031.@+olH\265\353\025\300M\342/\014|\342\021\300"
      }
    }
  }
}
node {
  name: "tensors/component_14"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 13
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_DOUBLE
        tensor_shape {
          dim {
            size: 13
          }
        }
        tensor_content: "\211\343MP\301\262\345?u\342\246O\275\352+\300\232\274\005\361~d%\300\256\355\363\244\347\t&\300XD0\032\033\325(\300\372\222C\004\025|9\300\010\373;\350K\003\370?\r\362\232;\001\232\020@\004\247\370d\232\2770\300\031\333\n\361\332\227+\300\306\211\336\255\210\010(@</C1\323\243\"\300$d\2236v**\300"
      }
    }
  }
}
node {
  name: "tensors/component_15"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 13
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_DOUBLE
        tensor_shape {
          dim {
            size: 13
          }
        }
        tensor_content: "z\007,\357\312z\000@\355S\030(^#\004\300\233\3062?P\307-\300oU\242\213\321\321\357?c\262\362\204S\264\361?\037\200\r(\307~\"\300\260\2139\306D\343\373?k[\034\014H\347\032@@\2079y3(\026\300\034G\222\223\200;\024\300\226R=XF\3626@v\264\255\221-\0230@\373]p|\345\267\005\300"
      }
    }
  }
}
node {
  name: "tensors/component_16"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 13
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_DOUBLE
        tensor_shape {
          dim {
            size: 13
          }
        }
        tensor_content: ":\375\322\nrp\t@\371\027\207\350\355\311#\300I$W?^\316\352?\013k\'\3065q\355\277\332v6\262r\014\337?,\036\305\346Sc\033\300\010\037\237\327\271\013\372?k\274\242\035\261\345\030\300\027\365\334n\341\345\"@V^\016\256`k$\300\370\345Gr\020(3@@T\257\216\013\3602@\345\231\023\274&4\027@"
      }
    }
  }
}
node {
  name: "tensors/component_17"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 13
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_DOUBLE
        tensor_shape {
          dim {
            size: 13
          }
        }
        tensor_content: "\311\324\374\344:U\310?\331\267!a\365]\003\300\323.\312A\231\333\'\300\307\236\n[6\2770\300\346\370\242\213\274\353)\300\235\313\362;c\264\021\300\233,\324\306l\264\355?\341-V\2156\334\"@%2\020\024H5.@\221o\221>\020\342\031\300\232\223\310\272 \303$@?\300\253m\261\372E@\237w9\314920@"
      }
    }
  }
}
node {
  name: "tensors/component_18"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 13
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_DOUBLE
        tensor_shape {
          dim {
            size: 13
          }
        }
        tensor_content: "4G\216w\037\'\355\277\341z\340\013\235B!\300\213\342\036\214\355\243 \300w\311\177\037\312{\022@\353\345Qj\316h\032@\202\357&\364\312\026;@U\030\234\252\333\206\372? J\352\342\337\356,\300\366\222h\273\r}\030@\341\320\362\333\320%\353\277\206\277\343\216\013\365\027\300\312@\336\340\364\3006@\325\350\221\317\350\2675@"
      }
    }
  }
}
node {
  name: "tensors/component_19"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 13
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_DOUBLE
        tensor_shape {
          dim {
            size: 13
          }
        }
        tensor_content: "L\365\030H*F\361?Q\030\266\035\326\333\010\300\3076\277`\255`!\300\362Y\261*i\230&\300\373uYj\317\016(\300\221~\232Q\005`2@\000J\377\325\243\323\374?\225\214\r2\251R!@\213\306\032Jx?:@\377k\367v\201\312\000@\204\337\202q{\027\014\300\322\037!\360\033\3216@\357cN47\2221@"
      }
    }
  }
}
node {
  name: "tensors/component_20"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 13
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_DOUBLE
        tensor_shape {
          dim {
            size: 13
          }
        }
        tensor_content: "\357\303\024\033\256|\361?e\324Z\031d\212\027\300\t4\270\006\356\237\"\300\234}\234\3649\260\007\3001\274Z\222\242.\360\277\315\277Z\257\r&\373?\242\251\331RJ\376\n@>\023q\206\250\001\367?^\232\037\222x>(@\372\217\005.\025\202#@\025\255\0130Mr\370?RK\\\343\331^\321?\034\221cQ^n\030@"
      }
    }
  }
}
node {
  name: "tensors/component_21"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 13
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_DOUBLE
        tensor_shape {
          dim {
            size: 13
          }
        }
        tensor_content: "o\304m\204`\261\005@\361\373\302\312\032X\003@\201`_Q\'\303\004\300\203\300G\001\303\240\002\300}\326\014q\343\224\365\277BtH\213\"\231/@\235\373.\311bB\n@%#:k_m%@\002\357\276\274b\361\025@\245\240\374K\036B\"@\333\344\362T}%\'@s;\325\027\347\022\t\300\247\210\203\242\023p\014@"
      }
    }
  }
}
node {
  name: "tensors/component_22"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 13
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_DOUBLE
        tensor_shape {
          dim {
            size: 13
          }
        }
        tensor_content: "\027Q\355w\311\'\023@\325\025\034\207\214W\365\277\347\222ifW\243\020\300\255^2\026\2360%\300T\177\344\233\270!#\3006\210eG\373\3103@\341b\336R\317\006\366?\3063[\267\312\250\320\277n\277i\256,\245\360?\320\340\363\220\276\007\010@Wf#}t\267\346\277d\221\252\351\237-\022@%\365+\243\266\336!\300"
      }
    }
  }
}
node {
  name: "tensors/component_23"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 13
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_DOUBLE
        tensor_shape {
          dim {
            size: 13
          }
        }
        tensor_content: "A\326\377\315\231\261\t@\355dn8Y\263\330?\330\266\030:\210C\006\300{\342L`\326\261\023@\363U=L\020v\023@Dnr/\341\251\020\300M\335@\016Q\375\361?\270\366O\r\222\373\024@\251\277\376D\353\277\007@\226Hf\230 \256\371?\\K\321\353\005\r\023\300\362\252x:~m\377\277\"\365H4!\266\010\300"
      }
    }
  }
}
node {
  name: "tensors/component_24"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 13
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_DOUBLE
        tensor_shape {
          dim {
            size: 13
          }
        }
        tensor_content: "\325F\262\307h1\347\277\275V\300\034T\004\n\300R\022\236\344\006\225\032\300\342\021Q\264}<\"\300}\231\014\tL\304)\3007\327\302\220\314B\016@jG\023\216!\361\340?s;\000\266V\025\347??\271\261\215\354\333\003@\032\001:Z\"\243\022\300\0237\324\347)\220#\300\373\205\354+Me\346?J\177\024\240Xi\036\300"
      }
    }
  }
}
node {
  name: "tensors/component_25"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 13
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_DOUBLE
        tensor_shape {
          dim {
            size: 13
          }
        }
        tensor_content: "\260\271\370b\255\002\302\277/\317\267\243\263\275\003\300\346\340\262sG\017\372?I\330g\310\336\311\377\277\032\212\2319V\363\013\3005\200\t\341\014\333\031\300\301\302\027\204\030:\364?G\316\004\025\344d\021\300\245\016j\341\271\032\361\277\261o\364o\341\254\360\277\2161\375\303\365y\035\300m{\351\240\204\215 \300\206U$\243\366\331\007\300"
      }
    }
  }
}
node {
  name: "tensors/component_26"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 13
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_DOUBLE
        tensor_shape {
          dim {
            size: 13
          }
        }
        tensor_content: "|\3268\320ag\357\277\333\343\250\374\277\036\025\300\230\261,\320\330\236\017@\312d{\232\216]\006\300N\376TdlK\007\300\367r\376\341\222\r#@\206v\323K\031\005\363?Es\251\035GU\314\277j\025\275\326\264\253\037\300\346\265\375\246\375>\262\277\374b^\303\037\206\334\277i\205\016\177\250\262\366\277\236N\216\322\006L\034\300"
      }
    }
  }
}
node {
  name: "tensors/component_27"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 13
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_DOUBLE
        tensor_shape {
          dim {
            size: 13
          }
        }
        tensor_content: "\256\306\204\002\321\010\301?71\231\202\243f\025\300\326r\376\375\276\374\363\277\006S\234\342\243\013#\300J\223\306\n=K \300l\035SPx\023\337?\263\226;%\243\241\223?RF\024*\251\253\024\300\251\253\337e\001\305 \300C\007\202\346\t\034\n\3009\201\323\274\323Y\353?\253QoI\373\304$\300\220L\037\312\005\263&\300"
      }
    }
  }
}
node {
  name: "tensors/component_28"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 13
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_DOUBLE
        tensor_shape {
          dim {
            size: 13
          }
        }
        tensor_content: "\346\205\312\026\253:\005@a\300\227B\323\225\024\300q\317[\222\322\370\033@$~}\276/\321\022@\354M\237\346\026[\r@\023@c\261rB\035\300<\0300\231\2207\354?\017\372BQNE!@U\364fn`\275\371?\225*D\265\031\364\002\300\245>\337\032<?\023\300\205(\2178a-\344\277L\035\333Z\365\240#\300"
      }
    }
  }
}
node {
  name: "tensors/component_29"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 13
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_DOUBLE
        tensor_shape {
          dim {
            size: 13
          }
        }
        tensor_content: "\333d<z\324h\013@\254\346\373b\365\262\304\277\255\237\317\263M;\000@\026\0169H\371-\023\300\310\337\220f\270i!\300\262OQ\311\260;.\300\027\341>\224\263\272\347?\255\261\256\\\017\000\036\300aX\250\211\304\315\031\300\306\177\370\244\231\267\027\300\317\275\017\017\231\254\035@W\272\311\314\337\017\374\277\335b\225\226\"m\034\300"
      }
    }
  }
}
node {
  name: "tensors/component_30"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 13
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_DOUBLE
        tensor_shape {
          dim {
            size: 13
          }
        }
        tensor_content: "\317\203Z<\260\225\365?\256\265\2768p\"\n\300\326\344\271u\376\221\t@o\225Y\363\335m\363?\264\002+\030=X\313?D\014\265c\271\227\010\300\366k\022\203\256\273\360?V\037\353\377|\270\373?\353\355E\017h\017\024\300\277\022n\003\240m\032\300*Y\326\312;\322\026@\233\"p\257:\021\311?Ew\203\324!\356\004\300"
      }
    }
  }
}
node {
  name: "tensors/component_31"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 13
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_DOUBLE
        tensor_shape {
          dim {
            size: 13
          }
        }
        tensor_content: "\177\037\375=\307\206\363?\374\323\265.\360}\010\300\350\336\254p\022M\"@\016\353\264\374k\202\227?\007#s!\014s\367\277\275\nJn!\223\363\277\243z\033\'h\232\370?\300\004\271\352\014:\373\277\007\361\202\'|\200\027\300\233\020\370\272\231J\332\277\221H\210\360\247\235\022@d\000#\031\262e\370?G\017\215\034\230\200\364?"
      }
    }
  }
}
node {
  name: "tensors/component_32"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 13
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_DOUBLE
        tensor_shape {
          dim {
            size: 13
          }
        }
        tensor_content: "\tA}\013w\340\362?\277\313\356\016`\324\361\277\230\303\336sAE\337?\017Z#\261\210\262\031\300\2272\026\002]\035\036\300\256\236\266#\031\031\003@\'*h\241\225\030\366?<\326\227\336\274{\014@\304\312Lf\212\334\356\277\276\354\2278\227e\010\300n\240q7\027\346\t@\252\210\330\362\201\373\375?s\366;\241\237\023\020\300"
      }
    }
  }
}
node {
  name: "tensors/component_33"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 13
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_DOUBLE
        tensor_shape {
          dim {
            size: 13
          }
        }
        tensor_content: "/\321\250S\324@\315?G\237=Z\277O\325\277\016\372\3541\256&\373\277:\234\216\233\006<\014@\202[\023\364\206\233\001@I@V:\0013\"\300\341\267\244\205P\265\373?\210\327/\307\271p\t\300y\"0\263\272A\373\277k\256v\336t\002\005\300G\234\337/\227!\t@\212$\253\255\027\335\n@\362P\276\270\377-\376\277"
      }
    }
  }
}
node {
  name: "tensors/component_34"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 13
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_DOUBLE
        tensor_shape {
          dim {
            size: 13
          }
        }
        tensor_content: "\032\325e\270<y\337?\370 \365\'\310\334\361\277\016\213r\305\237\355\r\300u\331\312\343\201\277\006\300\001\003\n\r\2228\035\300\3130\353\264\354\315\t\300]qH/\307Z\362?Oej\351\254\226\374\277\252\364\312\245\273\r\340\277\344\206\336\2248\271\377\2779\203}\332\255\026\320\277{\303\242\326P\276\035@zU\305Tv\272\373\277"
      }
    }
  }
}
node {
  name: "tensors/component_35"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 13
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_DOUBLE
        tensor_shape {
          dim {
            size: 13
          }
        }
        tensor_content: "\302\214\374\325\027A\345?1\001\264\\\225\212\361\277\3339\262-|\242\004\300Y\337\332yM\004\007@\314T\336\304\000,\347\277\270B\007*\361i!\300\261g)k\304\004\361?\206\277\3602w\265\001\300\3011`\004\305\034\350?\361\343\210\236Q\333\337\277\021\244<b\272\212\356\277cxu\321\306\353\026@\261\034Z\365\255\034\332?"
      }
    }
  }
}
node {
  name: "tensors/component_36"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 13
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_DOUBLE
        tensor_shape {
          dim {
            size: 13
          }
        }
        tensor_content: "i\311&r[1\307\277\024\340\250\\\247\260\370?\325\276\005#@8\003@\250\3463p?\265\364?Y%\352\205&<\360\277\007\254\210Rx\204\016@\256\004\001\036\257\343\363?\325z;\355\2300\367\277\373\377_\276\327\213\027@\032\361=\330\320N\351\2770\001\363\302\367\017\006\300\256\270\013\331V\004\017@\242 B~\227+\360\277"
      }
    }
  }
}
node {
  name: "tensors/component_37"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 13
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_DOUBLE
        tensor_shape {
          dim {
            size: 13
          }
        }
        tensor_content: "\227)\227\273<^\361?\343;\2653\205\362\377?\304\353\200,\257\221\023@\206^\277s\213\265\007\300\266\320\270\370\340\202\023\300\003\330\216$4|%\300y*w\016\215\036\355?<\203R&f\022\373?\005(\274C\260.\013@B\330\223\301\263V\370\2778\201Z$&\'\363?\035\326\3251G\003\342?\024\314\207x\236\305\005@"
      }
    }
  }
}
node {
  name: "tensors/component_38"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 13
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_DOUBLE
        tensor_shape {
          dim {
            size: 13
          }
        }
        tensor_content: ")\356\334~\253H\364?B\026\241\356\317\037\333?\210\320\3527\261\363\023@\235}\201\365E\014\014@M;\320\360\365\313\371?\240\004^\326\254\305\375\277\204\233\037\031\037\301\357?s\334(|EL\365?\354\363\025\377\000T\014\300\266\244\014\252\t=\371\277\263\n\2440\000\273\021\300<}J\034\006\036\n@9\251Q\362\200\260\354?"
      }
    }
  }
}
node {
  name: "tensors/component_39"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 13
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_DOUBLE
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_DOUBLE
        tensor_shape {
          dim {
            size: 13
          }
        }
        tensor_content: "<\033\305\314\005L\363?\241\243\262\202T\270\345\277\310\323\256&\327\352\r@\227+\352\027O$\004\300\354R\231Gh\314\025\300\323\364\332V\220\273\366?\277r\003\363y\377\347?[\021\323\307\017\347\351?0C\265{\216Zy?hf/B\355\215\366?.X\005\357\2715\n\300\321\362\337\203\267\342\301\277\016\354Ib\216\237\377?"
      }
    }
  }
}
node {
  name: "tensors/component_40"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 13
          }
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
          dim {
            size: 13
          }
          dim {
            size: 1
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000\001\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "buffer_size"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 13
      }
    }
  }
}
node {
  name: "seed"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 0
      }
    }
  }
}
node {
  name: "seed2"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 0
      }
    }
  }
}
node {
  name: "count"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: -1
      }
    }
  }
}
node {
  name: "batch_size"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 100
      }
    }
  }
}
node {
  name: "Iterator"
  op: "Iterator"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "output_types"
    value {
      list {
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_INT64
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "TensorSliceDataset"
  op: "TensorSliceDataset"
  input: "tensors/component_0"
  input: "tensors/component_1"
  input: "tensors/component_2"
  input: "tensors/component_3"
  input: "tensors/component_4"
  input: "tensors/component_5"
  input: "tensors/component_6"
  input: "tensors/component_7"
  input: "tensors/component_8"
  input: "tensors/component_9"
  input: "tensors/component_10"
  input: "tensors/component_11"
  input: "tensors/component_12"
  input: "tensors/component_13"
  input: "tensors/component_14"
  input: "tensors/component_15"
  input: "tensors/component_16"
  input: "tensors/component_17"
  input: "tensors/component_18"
  input: "tensors/component_19"
  input: "tensors/component_20"
  input: "tensors/component_21"
  input: "tensors/component_22"
  input: "tensors/component_23"
  input: "tensors/component_24"
  input: "tensors/component_25"
  input: "tensors/component_26"
  input: "tensors/component_27"
  input: "tensors/component_28"
  input: "tensors/component_29"
  input: "tensors/component_30"
  input: "tensors/component_31"
  input: "tensors/component_32"
  input: "tensors/component_33"
  input: "tensors/component_34"
  input: "tensors/component_35"
  input: "tensors/component_36"
  input: "tensors/component_37"
  input: "tensors/component_38"
  input: "tensors/component_39"
  input: "tensors/component_40"
  attr {
    key: "Toutput_types"
    value {
      list {
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_DOUBLE
        type: DT_INT64
      }
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@Iterator"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
        shape {
        }
        shape {
        }
        shape {
        }
        shape {
        }
        shape {
        }
        shape {
        }
        shape {
        }
        shape {
        }
        shape {
        }
        shape {
        }
        shape {
        }
        shape {
        }
        shape {
        }
        shape {
        }
        shape {
        }
        shape {
        }
        shape {
        }
        shape {
        }
        shape {
        }
        shape {
        }
        shape {
        }
        shape {
        }
        shape {
        }
        shape {
        }
        shape {
        }
        shape {
        }
        shape {
        }
        shape {
        }
        shape {
        }
        shape {
        }
        shape {
        }
        shape {
        }
        shape {
        }
        shape {
        }
        shape {
        }
        shape {
        }
        shape {
        }
